In [ ]:
import pandas as pd
df3=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv",sep="\t")
df3

In [ ]:
#1.PRINT FIRST 5 AND 7 RECORDS
#======================================================================================================================================================
df=df3.head()
df

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [ ]:
df1=df3.tail(7)
df1

      order_id  ...  item_price
4615      1832  ...      $8.75
4616      1832  ...      $4.45
4617      1833  ...     $11.75
4618      1833  ...     $11.75
4619      1834  ...     $11.25
4620      1834  ...      $8.75
4621      1834  ...      $8.75

[7 rows x 5 columns]

In [ ]:
#2.PRINT TOTAL RECORDS AND TYPE OF VARIABLES
#===================================================================================================================================================
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [ ]:
#3.PRINT THE NAMES OF ALL COLOUMNS 
#========================================================================================================================================================
print(list(df3.columns))

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [ ]:
#4.HOW IS THE DATASET INDEXED?
#==========================================================================================================================================================
df3.index

RangeIndex(start=0, stop=4622, step=1)

In [ ]:
#5.WHICH WAS THE MOST ORDERED ITEM?HOW MANY ITEMS WHERE ORDERED
#=============================================================================================================================================================
d = df3.groupby('item_name')
d=d.sum()
v=d.sort_values("quantity",ascending=False)
v.head()

                     order_id  quantity
item_name
Chicken Bowl           713926       761
Chicken Burrito        497303       591
Chips and Guacamole    449959       506
Steak Burrito          328437       386
Canned Soft Drink      304753       351

In [ ]:

#6.WHICH WAS THE MOST ORDERED ITEM IN THE   choice_description COLUMN?
#=============================================================================================================================================================
df4 = df3.groupby('choice_description')
d1=df4.sum()
df5=d1.sort_values("quantity",ascending=False)
df5.head()

                                                    order_id  quantity
choice_description
[Diet Coke]                                           123455       159
[Coke]                                                122752       143
[Sprite]                                               80426        89
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese...     43088        49
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese...     36041        42

In [ ]:
#7.TURN THE ITEM PRICE INTO A FLOAT
#=======================================================================================================================================================
def getprice(strprice):
      str1=strprice
      return (float(str1[1:]))

df3['pricenew']=df3['item_price'].apply(getprice)
df3.head()

   order_id  quantity  ... item_price pricenew
0         1         1  ...     $2.39      2.39
1         1         1  ...     $3.39      3.39
2         1         1  ...     $3.39      3.39
3         1         1  ...     $2.39      2.39
4         2         2  ...    $16.98     16.98

[5 rows x 6 columns]

In [ ]:

df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
 5   pricenew            4622 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 216.8+ KB

In [ ]:
#8.PRINT A DATAFRAME WITH ONLY TWO COLUMNS item_name AND item_price
#=============================================================================================================================================================
df=df3[['item_name', 'item_price']]

                item_name  item_price
4615   Chicken Soft Tacos        8.75
4616  Chips and Guacamole        4.45
4617        Steak Burrito       11.75
4618        Steak Burrito       11.75
4619   Chicken Salad Bowl       11.25
4620   Chicken Salad Bowl        8.75
4621   Chicken Salad Bowl        8.75

In [ ]:
#9.DELETE THE DUPLICATE ITEMS IN item_name and quantity
#================================================================================================================================================================
df89=df3.drop_duplicates('item_name')
df89.tail(7)

      order_id  quantity  ... item_price pricenew
738        304         1  ...      11.25    11.25
1132       468         1  ...      11.89    11.89
1229       501         1  ...      11.89    11.89
1414       575         1  ...       7.40     7.40
1653       668         1  ...       8.49     8.49
1694       686         1  ...       8.49     8.49
3750      1500         1  ...       8.99     8.99

[7 rows x 6 columns]

In [ ]:
#10.select only the products with quantity equals to 1
#============================================================================================================================================================
rslt_df = df3.loc[df3['quantity'] ==1] 
rslt_df=rslt_df[['item_name', 'quantity']]
rslt_df

                                  item_name  quantity
0              Chips and Fresh Tomato Salsa         1
1                                      Izze         1
2                          Nantucket Nectar         1
3     Chips and Tomatillo-Green Chili Salsa         1
5                              Chicken Bowl         1
...                                     ...       ...
4617                          Steak Burrito         1
4618                          Steak Burrito         1
4619                     Chicken Salad Bowl         1
4620                     Chicken Salad Bowl         1
4621                     Chicken Salad Bowl         1

[4355 rows x 2 columns]

In [ ]:
#11.select only the item_name and item_price columns
#===================================================================================================================================================================
rslt_df1=df3[['item_name', 'item_price']]
rslt_df1

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4617                          Steak Burrito       11.75
4618                          Steak Burrito       11.75
4619                     Chicken Salad Bowl       11.25
4620                     Chicken Salad Bowl        8.75
4621                     Chicken Salad Bowl        8.75

[4622 rows x 2 columns]

In [ ]:
#12. sort item from the most to less expensive
#==========================================================================================================================================================
df66=df3.sort_values("pricenew",ascending=False)
df66=df66[['item_name','pricenew']]
df66

                         item_name  pricenew
3598  Chips and Fresh Tomato Salsa     44.25
3480                 Carnitas Bowl     35.25
1254               Chicken Burrito     35.00
3602               Chicken Burrito     35.00
3601                Veggie Burrito     33.75
...                            ...       ...
3936                   Canned Soda      1.09
2922                 Bottled Water      1.09
1396                   Canned Soda      1.09
2562                   Canned Soda      1.09
1457                   Canned Soda      1.09

[4622 rows x 2 columns]

In [33]:
#13.What was the quantity of the most expensive item ordered?
#==========================================================================================================================================================
df66=df3.sort_values("pricenew",ascending=False)
df66[['quantity','item_name','pricenew']].head(1)

      quantity                     item_name  pricenew
3598        15  Chips and Fresh Tomato Salsa     44.25

In [36]:
#14.How many times were a Veggie Salad Bowl ordered?
#============================================================================================================================
rslt_df = df3.loc[df3['item_name'] =='Veggie Salad Bowl'] 
dd=rslt_df[['item_name','quantity']].value_counts()
dd

[item_name          quantity
 Veggie Salad Bowl  1           18
 dtype: int64]